turbq/atprog/packs/atmel/SAM3N_DFP/1.0.62/atdf/ATSAM3N1B.atdf
        <module name="EFC" version="6450H">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0A00"/>
            <parameters>
              <param name="FLASH_SIZE" value="65536"/>
              <param name="PAGE_SIZE" value="256"/>
              <param name="PAGES_PR_REGION" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" version="6378C">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1490"/>
          </instance>
        </module>
        <module name="MATRIX" version="11049A">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0200"/>
          </instance>
        </module>
        <module name="PIO" version="11004F">
          <instance name="PIOA">
            <register-group address-space="base" name="PIOA" name-in-module="PIO" offset="0x400E0E00"/>
          </instance>
          <instance name="PIOB">
            <register-group address-space="base" name="PIOB" name-in-module="PIO" offset="0x400E1000"/>
          </instance>
        </module>
        <module name="PMC" version="11116G">
          <instance name="PMC">
            <register-group address-space="base" name="PMC" name-in-module="PMC" offset="0x400E0400"/>
            <signals>
              <signal pad="PA6" function="B" group="PCK" index="0"/>
              <signal pad="PB13" function="B" group="PCK" index="0"/>
              <signal pad="PC16" function="B" group="PCK" index="0"/>
              <signal pad="PA17" function="B" group="PCK" index="1"/>
              <signal pad="PA21" function="B" group="PCK" index="1"/>
              <signal pad="PC17" function="B" group="PCK" index="1"/>
              <signal pad="PA18" function="B" group="PCK" index="2"/>
              <signal pad="PA31" function="B" group="PCK" index="2"/>
              <signal pad="PB3" function="B" group="PCK" index="2"/>
              <signal pad="PC14" function="B" group="PCK" index="2"/>
            </signals>
          </instance>
        </module>
        <module name="PWM" version="6044I">
          <instance name="PWM">
            <register-group address-space="base" name="PWM" name-in-module="PWM" offset="0x40020000"/>
            <signals>
              <signal pad="PA0" function="A" group="PWM" index="0"/>
              <signal pad="PA11" function="B" group="PWM" index="0"/>
              <signal pad="PA23" function="B" group="PWM" index="0"/>
              <signal pad="PB0" function="A" group="PWM" index="0"/>
              <signal pad="PC8" function="B" group="PWM" index="0"/>
              <signal pad="PC18" function="B" group="PWM" index="0"/>
              <signal pad="PC22" function="B" group="PWM" index="0"/>
              <signal pad="PA1" function="A" group="PWM" index="1"/>
              <signal pad="PA12" function="B" group="PWM" index="1"/>
              <signal pad="PA24" function="B" group="PWM" index="1"/>
              <signal pad="PB1" function="A" group="PWM" index="1"/>
              <signal pad="PC9" function="B" group="PWM" index="1"/>
              <signal pad="PC19" function="B" group="PWM" index="1"/>
              <signal pad="PA2" function="A" group="PWM" index="2"/>
              <signal pad="PA13" function="B" group="PWM" index="2"/>
              <signal pad="PA25" function="B" group="PWM" index="2"/>
              <signal pad="PB4" function="B" group="PWM" index="2"/>
              <signal pad="PC10" function="B" group="PWM" index="2"/>
              <signal pad="PC20" function="B" group="PWM" index="2"/>
              <signal pad="PA7" function="B" group="PWM" index="3"/>
              <signal pad="PA14" function="B" group="PWM" index="3"/>
              <signal pad="PB14" function="B" group="PWM" index="3"/>
              <signal pad="PC11" function="B" group="PWM" index="3"/>
              <signal pad="PC21" function="B" group="PWM" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="RSTC" version="11009A">
          <instance name="RSTC">
            <register-group address-space="base" name="RSTC" name-in-module="RSTC" offset="0x400E1400"/>
          </instance>
        </module>
        <module name="RTC" version="6056I">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x400E1460"/>
          </instance>
        </module>
        <module name="RTT" version="6081F">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x400E1430"/>
          </instance>
        </module>
        <module name="SPI" version="6088R">
          <instance name="SPI">
            <register-group address-space="base" name="SPI" name-in-module="SPI" offset="0x40008000"/>
            <signals>
              <signal pad="PA12" function="A" group="MISO"/>
              <signal pad="PA13" function="A" group="MOSI"/>
              <signal pad="PA11" function="A" group="NPCS" index="0"/>
              <signal pad="PA9" function="B" group="NPCS" index="1"/>
              <signal pad="PA31" function="A" group="NPCS" index="1"/>
              <signal pad="PB14" function="A" group="NPCS" index="1"/>
              <signal pad="PC4" function="B" group="NPCS" index="1"/>
              <signal pad="PA10" function="B" group="NPCS" index="2"/>
              <signal pad="PA30" function="B" group="NPCS" index="2"/>
              <signal pad="PB2" function="B" group="NPCS" index="2"/>
              <signal pad="PC7" function="B" group="NPCS" index="2"/>
              <signal pad="PA3" function="B" group="NPCS" index="3"/>
              <signal pad="PA5" function="B" group="NPCS" index="3"/>
              <signal pad="PA22" function="B" group="NPCS" index="3"/>
              <signal pad="PA14" function="A" group="SPCK"/>
            </signals>
          </instance>
        </module>
        <module name="SUPC" version="6452M">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400E1410"/>
